app/views/users/_form.html.erb

<div class="form-group check_boxes">
    <%= f.collection_check_boxes(:ccg_ids, Ccg.all, :id, :name) do |c| %>
---
SELECT "ccgs".* FROM "ccgs" WHERE 1=0