app/views/users/_users.html.erb

            <td>
                <%user.ccgs.each do |ccg|%>
---
SELECT  "ccgs".* FROM "ccgs" INNER JOIN "ccg_users" ON "ccgs"."id" = "ccg_users"."ccg_id" WHERE "ccg_users"."user_id" = ? ORDER BY "ccgs"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]