app/views/users/index.html.erb

SELECT "users".* FROM "users"
SELECT "ccgs".* FROM "ccgs" INNER JOIN "ccg_users" ON "ccgs"."id" = "ccg_users"."ccg_id" WHERE "ccg_users"."user_id" = ?  [["user_id", 1]]
---
<div class="info">
    <%User.all.each do |user|%>
        <td><%= link_to "#{user.Username}", user_path(user) %> </td>
        <sm><%user.ccgs.each do |ccg|%>