app/views/users/show.html.erb

SELECT "ccgs"."id" FROM "ccgs" INNER JOIN "ccg_users" ON "ccgs"."id" = "ccg_users"."ccg_id" WHERE "ccg_users"."user_id" = ?  [["user_id", 24]]
SELECT  "ccgs".* FROM "ccgs" WHERE "ccgs"."id" IN (?, ?) LIMIT ?  [["id", 4], ["id", 12], ["LIMIT", 1]]
---
        <ul>
        <% @user.ccg_ids.uniq.each do |g| %>
          <li class="info__list--item"><%=Ccg.find(g).name%></li>