app/views/games/_deckform.html.erb

SELECT "tags".* FROM "tags" WHERE 1=0
---
                <div class="row">
        <%= g.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |c| %>