app/views/games/_form.html.erb

SELECT "tags".* FROM "tags" WHERE 1=0
---
            <h4>Tags</h4>
   <%= g.collection_check_boxes(:tag_ids, Tag.all, :id, :name) %>