app/views/games/index.html.erb

                            <td class="game__tags">
                                <%game.tags.each do |tag|%>
---
SELECT "tags".* FROM "tags" INNER JOIN "game_tags" ON "tags"."id" = "game_tags"."tag_id" WHERE "game_tags"."game_id" = ?  [["game_id", 65]]