app/views/games/new.html.erb

    <label><h4><center>Tags</center></h4></label><br>
    <% Tag.all.each do |tag| %>
---
SELECT "tags".* FROM "tags" WHERE 1=0