app/views/games/new.html.erb

<%else%>
    <%if current_user.decks.length>0%>
---
SELECT "decks".* FROM "decks" WHERE "decks"."user_id" = ?  [["user_id", 9]]