app/controllers/decks_controller.rb

    def index
        @decks=Deck.all
---
SELECT "decks".* FROM "decks"

    def edit
        @deck = Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @deck= Deck.new(deck_params)
        @deck.user_id=current_user.id
        @deck.wins=0
        @deck.losses=0
        respond_to do |format|
            if @deck.save
---
INSERT INTO "decks" ("name", "wins", "losses", "user_id", "ccg_id", "link", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["name", "HELPME!"], ["wins", 0], ["losses", 0], ["user_id", 1], ["ccg_id", 1], ["link", ""], ["created_at", "2018-08-24 17:30:30.049079"], ["updated_at", "2018-08-24 17:30:30.049079"]]

    def update
        respond_to do |format|
            if @deck.update(deck_params)
---
UPDATE "decks" SET "name" = ?, "updated_at" = ? WHERE "decks"."id" = ?  [["name", "Esper Crown!"], ["updated_at", "2018-08-23 15:20:30.018298"], ["id", 2]]

    def destroy
        @deck.destroy
---
DELETE FROM "decks" WHERE "decks"."id" = ?  [["id", 16]]

    def set_deck
        @deck=Deck.find(params[:id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]