app/controllers/games_controller.rb

    def index
        if @deck
          @games=current_user.games.where(deck: @deck).select{|g| g.created_at.today?}
---
SELECT  "games".* FROM "games" WHERE "games"."deck_id" = ? AND "games"."id" = ? LIMIT ?  [["deck_id", 42], ["id", 65], ["LIMIT", 1]]

    def delete
      current_user.games.last.destroy
---
DELETE FROM "games" WHERE "games"."id" = ?  [["id", 41]]
SELECT  "games".* FROM "games" WHERE "games"."user_id" = ? ORDER BY "games"."id" DESC LIMIT ?  [["user_id", 22], ["LIMIT", 1]]

    def show
      @game=Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]

    def create
      if params[:deck_id]!=nil
        set_deck
        @game=Game.new(game_params)
        @game.deck_id=@deck.id
        @game.user_id=current_user.id
        @route="/decks/#{@deck.id}/games/new"
      elsif params[:action]=="create"&& params[:game][:deck_id]!=""
        @game=Game.new(game_params)
        @route="/games/new"
        @deck=Deck.find(id=@game.deck_id)
        @game.user_id=current_user.id
      else
          @route="/games/new"
          @decks=current_user.decks
      end
      respond_to do |format|
        if (!!@game)
          make_tags(@game)

          if @game.save
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."deck_id" = ?  [["deck_id", 40]]
INSERT INTO "games" ("user_id", "deck_id", "result", "opponent_deck", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 22], ["deck_id", 40], ["result", "Win"], ["opponent_deck", "adsf"], ["created_at", "2018-09-03 20:21:35.800803"], ["updated_at", "2018-09-03 20:21:35.800803"], ["comment", "asdf"]]
UPDATE "decks" SET "losses" = ?, "updated_at" = ? WHERE "decks"."id" = ?  [["losses", 1], ["updated_at", "2018-08-24 20:26:43.091467"], ["id", 11]]

      def set_deck
        @deck=Deck.find_by_id(params[:deck_id])
---
SELECT  "decks".* FROM "decks" WHERE "decks"."id" = ? LIMIT ?  [["id", 54], ["LIMIT", 1]]