app/controllers/sessions_controller.rb

SELECT "users".* FROM "users"
---
      def new
        @user = User.new
        @users = User.all

SELECT  "users".* FROM "users" WHERE "users"."name" = ? LIMIT ?  [["name", "Christopher"], ["LIMIT", 1]]
---
      def create
        @user = User.find_by(name: params[:name])

INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at", "uid") VALUES (?, ?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "117503569199947"], ["LIMIT", 1]]
---
      def gcreate
        @user = User.find_or_create_by(uid: auth['uid']) do |u|