app/controllers/sessions_controller.rb

      def create
        @user = User.find_by(Username: params[:Username])
---
SELECT  "users".* FROM "users" WHERE "users"."user_name" = ? LIMIT ?  [["user_name", "chris"], ["LIMIT", 1]]