app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    @user.ccg_ids=params[:user][:ccg_ids]
    respond_to do |format|
      if @user.save
---
INSERT INTO "ccg_users" ("ccg_id", "user_id") VALUES (?, ?)  [["ccg_id", 3], ["user_id", 24]]
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "wood"], ["password_digest", "$2a$10$pMqX1Tb0Ygn82y2TB0KDgegMgeg4K7ibsNDricC3d9X01FkqXobOu"], ["created_at", "2018-08-22 17:28:24.918837"], ["updated_at", "2018-08-22 17:28:24.918837"]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "Username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["Username", "NautaSquid"], ["password_digest", "$2a$10$ncVT9hxjLdpXFlKKnhiFneGjMl81OSC8XWKGlTx3tkUVPln3QaHlW"], ["updated_at", "2018-09-03 14:18:41.827162"], ["id", 1]]