app/views/decks/_form.html.erb

SELECT "ccgs".* FROM "ccgs"
---
        <div class="field"><%= d.label :ccg, "Select the CCG" %><br>
            <%= d.collection_select(:ccg_id, Ccg.all, :id, :name) %><br><br>