app/views/decks/new.html.erb

    </div>
    <%if current_user.ccgs.length>0%>
---
SELECT "ccgs".* FROM "ccgs" INNER JOIN "ccg_users" ON "ccgs"."id" = "ccg_users"."ccg_id" WHERE "ccg_users"."user_id" = ?  [["user_id", 2]]